# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [6]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [18]:
a=pd.Series(np.random.randint(1,4,size=100))
b=pd.Series(np.random.randint(1,3,size=100))
c=pd.Series(np.random.randint(10000,30000,size=100))
a
b
c

0     22090
1     24598
2     23375
3     13927
4     17549
      ...
95    11394
96    22188
97    25151
98    10086
99    27450
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [19]:
df = pd.DataFrame(a)
df[1]=b
df[2]=c
df

    0  1      2
0   2  1  22090
1   2  1  24598
2   2  1  23375
3   1  1  13927
4   3  1  17549
.. .. ..    ...
95  1  2  11394
96  1  2  22188
97  3  1  25151
98  3  2  10086
99  3  1  27450

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [20]:
df.set_axis(['bedrs', 'bathrs', 'price_sqr_meter'],axis=1)

    bedrs  bathrs  price_sqr_meter
0       2       1            22090
1       2       1            24598
2       2       1            23375
3       1       1            13927
4       3       1            17549
..    ...     ...              ...
95      1       2            11394
96      1       2            22188
97      3       1            25151
98      3       2            10086
99      3       1            27450

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [22]:
bigcolumn= pd.concat([a,b,c],axis=0)
bigcolumn =bigcolumn.to_frame()
bigcolumn

        0
0       2
1       2
2       2
3       1
4       3
..    ...
95  11394
96  22188
97  25151
98  10086
99  27450

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [ ]:
yes

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [24]:
bigcolumn.reset_index(drop=True,inplace=True)

In [25]:
bigcolumn

         0
0        2
1        2
2        2
3        1
4        3
..     ...
295  11394
296  22188
297  25151
298  10086
299  27450

[300 rows x 1 columns]